app/controllers/todos_controller.rb

INSERT INTO "todos" ("created_at", "notes", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Oct 2015 15:53:55 UTC +00:00], ["notes", ""], ["title", ""], ["updated_at", Mon, 12 Oct 2015 15:53:55 UTC +00:00]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "notes" = ?, "updated_at" = ? WHERE "todos"."id" = 3  [["notes", "Register Kira for Ruby Junior High and Caleb for Rails High School     sdsf"], ["updated_at", Mon, 12 Oct 2015 17:15:41 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)